# Transaction Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Transaction Constructor
Transaction Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Transaction(Document) | Instantiates a transaction object. |
| Transaction(Document, String) | Instantiates a transaction object |

# See Also
Transaction Class
Transaction Members
Autodesk.Revit.DB Namespace